In [27]:
# Import libraries.

In [28]:
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

In [29]:
# Prepare Data

In [30]:
## Use Pandas to read in each of the CSV files as a DataFrame. Be sure to convert the dates to a DateTimeIndex.

In [31]:
whale_returns_csv = Path("Resources/whale_returns.csv")
whale_returns = pd.read_csv(whale_returns_csv, index_col="Date", parse_dates=True)
whale_returns.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [32]:
algo_returns_csv = Path("Resources/algo_returns.csv")
algo_returns = pd.read_csv(algo_returns_csv, index_col="Date", parse_dates=True)
algo_returns.head()

              Algo 1  Algo 2
Date
2014-05-28  0.001745     NaN
2014-05-29  0.003978     NaN
2014-05-30  0.004464     NaN
2014-06-02  0.005692     NaN
2014-06-03  0.005292     NaN

In [33]:
sp500_history_csv = Path("Resources/sp500_history.csv")
sp500_history = pd.read_csv(sp500_history_csv, index_col="Date", parse_dates=True)
sp500_history.head()

               Close
Date
2019-04-23  $2933.68
2019-04-22  $2907.97
2019-04-18  $2905.03
2019-04-17  $2900.45
2019-04-16  $2907.06

In [34]:
## Detect and remove null values.

In [35]:
whale_returns.isnull().sum()

SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [37]:
whale_returns.dropna(inplace=True)
whale_returns.isnull().sum()

SOROS FUND MANAGEMENT LLC      0
PAULSON & CO.INC.              0
TIGER GLOBAL MANAGEMENT LLC    0
BERKSHIRE HATHAWAY INC         0
dtype: int64

In [38]:
algo_returns.isnull().sum()

Algo 1    0
Algo 2    6
dtype: int64

In [39]:
algo_returns.dropna(inplace=True)
algo_returns.isnull().sum()

Algo 1    0
Algo 2    0
dtype: int64

In [44]:
## Remove dollar signs from the numeric values and convert the data types as needed.
sp500_history.head()

               Close
Date
2019-04-23  $2933.68
2019-04-22  $2907.97
2019-04-18  $2905.03
2019-04-17  $2900.45
2019-04-16  $2907.06

In [46]:
sp500_history['Close'] = sp500_history['Close'].str.replace('$', '')
sp500_history.head()

              Close
Date
2019-04-23  2933.68
2019-04-22  2907.97
2019-04-18  2905.03
2019-04-17  2900.45
2019-04-16  2907.06

In [47]:
sp500_history.dtypes

Close    object
dtype: object

In [60]:
sp500_history['Close'] = sp500_history['Close'].astype('float')
sp500_history.dtypes
sp500_history['Close'] = sp500_history['Close'].pct_change()
sp500_history.head()

               Close
Date
2019-04-17       NaN
2019-04-16  2.290759
2019-04-15 -0.906968
2019-04-12 -2.658096
2019-04-11  3.956560

In [61]:
## Detect and remove null values for S&P 500 Historic Prices.

In [62]:
sp500_history.isnull().sum()

Close    1
dtype: int64

In [63]:
sp500_history.dropna(inplace=True)
sp500_history.isnull().sum()

Close    0
dtype: int64

In [66]:
## The whale portfolios and algorithmic portfolio CSV files contain daily returns, but the S&P 500 CSV file contains closing prices. Convert the S&P 500 closing prices to daily returns.
sp500_history = sp500_history.rename(columns={
    "Close": "S & P 500"
})
sp500_history.head()

            S & P 500
Date
2019-04-16   2.290759
2019-04-15  -0.906968
2019-04-12  -2.658096
2019-04-11   3.956560
2019-04-10  -1.222295